In [1]:
import pandas as pd
import numpy as np

In [3]:
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,np.nan,99,87,np.nan,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female'],
                'Email':['priyang@gmail.com','aadhya@gmail.com',
                        'krisha@gmail.com','vedant@yahoo.com','parshv@hotmail.com',
                         'mittal@yahoo.com','archana@yahoo.com']
               }
df1=pd.DataFrame(dict1)
df1

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya    NaN  Female    aadhya@gmail.com
2   Krisha   99.0  Female    krisha@gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv    NaN    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

# 1. Display top 3 rows of the dataset

In [6]:
df1.head(3)

      Name  Marks  Gender              Email
0  Priyang   98.0    Male  priyang@gmail.com
1   Aadhya    NaN  Female   aadhya@gmail.com
2   Krisha   99.0  Female   krisha@gmail.com

# 2. Last 3 rows of the dataset

In [7]:
df1.tail(3)

      Name  Marks  Gender               Email
4   Parshv    NaN    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

# 3. Display all rows except last 2 rows

In [8]:
df1.head(-2)

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya    NaN  Female    aadhya@gmail.com
2   Krisha   99.0  Female    krisha@gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv    NaN    Male  parshv@hotmail.com

# 4. Display all rows except first 2 rows

In [9]:
df1.tail(-3)

      Name  Marks  Gender               Email
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv    NaN    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

# 5. Find the shape of our dataset

In [10]:
df1.shape

(7, 4)

In [11]:
print("Number of rows ",df1.shape[0])
print("Number of rows ",df1.shape[1])

Number of rows  7
Number of rows  4

# 6. get information about our dataset

In [13]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   5 non-null      float64
 2   Gender  7 non-null      object
 3   Email   7 non-null      object
dtypes: float64(1), object(3)
memory usage: 352.0+ bytes

# 7. Check null values in our dataset

In [17]:
df1.isnull().sum()

Name      0
Marks     2
Gender    0
Email     0
dtype: int64

In [23]:
df1.notna()

   Name  Marks  Gender  Email
0  True   True    True   True
1  True  False    True   True
2  True   True    True   True
3  True   True    True   True
4  True  False    True   True
5  True   True    True   True
6  True   True    True   True

# 8. Get overall statistics about the dataset

In [18]:
df1.describe()

           Marks
count   5.000000
mean   93.200000
std     7.628892
min    83.000000
25%    87.000000
50%    98.000000
75%    99.000000
max    99.000000

# 9. Find unique value from gender column

unique method work on only a particular column i.e pandas series. it cannot be apply
on whole dataframe.

In [28]:
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

# 10. Find the number of unique value

here nunique() method can be apply on both pandas series(column) and pandas dataframe(whole table)

In [29]:
df1['Gender'].nunique()

2

In [31]:
df1.nunique() # here we applied this method on whole dataframe

Name      7
Marks     4
Gender    2
Email     7
dtype: int64

# 11. Display count of unique value in gender column

In [32]:
df1['Gender'].value_counts()

Female    4
Male      3
Name: Gender, dtype: int64

# 12. handle missing  data

### Ways to handle missing data


#### 1. df1.dropna() -- it will drop all the values having null value(whether single or more null value). -- not a good method

#### 2. df1.dropna(how='all') -- it will drop the whole row IF ALL VALUES IN THAT ROW ARE NULL

#### 3. df1.dropna(how='any') -- it will drop the whole row IF ANY  VALUE(even a single value) IN THAT ROW ARE NULL


**Note:** dropna() and dropna(how='any') is looking same

In [35]:
df1

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya    NaN  Female    aadhya@gmail.com
2   Krisha   99.0  Female    krisha@gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv    NaN    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

In [38]:
df1.dropna() # it removed all values having one or more than one null values

      Name  Marks  Gender              Email
0  Priyang   98.0    Male  priyang@gmail.com
2   Krisha   99.0  Female   krisha@gmail.com
3   Vedant   87.0    Male   vedant@yahoo.com
5   Mittal   83.0  Female   mittal@yahoo.com
6  Archana   99.0  Female  archana@yahoo.com

In [39]:
df1.dropna(how="any")

      Name  Marks  Gender              Email
0  Priyang   98.0    Male  priyang@gmail.com
2   Krisha   99.0  Female   krisha@gmail.com
3   Vedant   87.0    Male   vedant@yahoo.com
5   Mittal   83.0  Female   mittal@yahoo.com
6  Archana   99.0  Female  archana@yahoo.com

In [40]:
df1.dropna(how='all')

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya    NaN  Female    aadhya@gmail.com
2   Krisha   99.0  Female    krisha@gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv    NaN    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

### Filling null values

In [42]:
df1.fillna(0) # all the missing value with 0.00

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya    0.0  Female    aadhya@gmail.com
2   Krisha   99.0  Female    krisha@gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv    0.0    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

In [43]:
df1.fillna(999) # now missing values will fill with 999

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya  999.0  Female    aadhya@gmail.com
2   Krisha   99.0  Female    krisha@gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv  999.0    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

#### filling value in a particular column

In [44]:
df1

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya    NaN  Female    aadhya@gmail.com
2   Krisha   99.0  Female    krisha@gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv    NaN    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

In [46]:
# to fil the missing values in markes column by average value 
df1['Marks']=df1['Marks'].fillna(df1['Marks'].mean())

In [47]:
df1

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya   93.2  Female    aadhya@gmail.com
2   Krisha   99.0  Female    krisha@gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv   93.2    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

# 13. Display number of students having marks between 80 to 90

In [53]:
# first method
sum((df1['Marks']>=80) & (df1['Marks']<=90))

2

In [56]:
# second method using BETWEEN method

sum(df1['Marks'].between(80,90))

2

# 14. Name of the students with the lowest marks

In [59]:
df1.columns

Index(['Name', 'Marks', 'Gender', 'Email'], dtype='object')

In [62]:
df1['Marks'].sort_values()['Name']

KeyError: 'Name'

In [70]:
df1[df1['Marks'].min()==df1['Marks']]['Name']

5    Mittal
Name: Name, dtype: object

# 15. Top 5 students by their marks

In [71]:
df1.columns

Index(['Name', 'Marks', 'Gender', 'Email'], dtype='object')

In [85]:
df1[['Name','Marks']].sort_values(by='Marks',ascending=False).head()

      Name  Marks
2   Krisha   99.0
6  Archana   99.0
0  Priyang   98.0
1   Aadhya   93.2
4   Parshv   93.2

In [82]:
# second method

df1.nlargest(5,['Marks'])['Name']

2     Krisha
6    Archana
0    Priyang
1     Aadhya
4     Parshv
Name: Name, dtype: object

# 16. Average value of Marks column

In [86]:
df1['Marks'].mean()

93.2

In [87]:
df1['Marks'].min()

83.0

In [88]:
df1['Marks'].max()

99.0

# 17. Apply Method ( very important )

In [89]:
def marks(x):
    return x/2

In [91]:
df1['Half_marks']= df1['Marks'].apply(marks)

In [92]:
df1

      Name  Marks  Gender               Email  Half_marks
0  Priyang   98.0    Male   priyang@gmail.com        49.0
1   Aadhya   93.2  Female    aadhya@gmail.com        46.6
2   Krisha   99.0  Female    krisha@gmail.com        49.5
3   Vedant   87.0    Male    vedant@yahoo.com        43.5
4   Parshv   93.2    Male  parshv@hotmail.com        46.6
5   Mittal   83.0  Female    mittal@yahoo.com        41.5
6  Archana   99.0  Female   archana@yahoo.com        49.5

# 18. Map function

In [93]:
df1

      Name  Marks  Gender               Email  Half_marks
0  Priyang   98.0    Male   priyang@gmail.com        49.0
1   Aadhya   93.2  Female    aadhya@gmail.com        46.6
2   Krisha   99.0  Female    krisha@gmail.com        49.5
3   Vedant   87.0    Male    vedant@yahoo.com        43.5
4   Parshv   93.2    Male  parshv@hotmail.com        46.6
5   Mittal   83.0  Female    mittal@yahoo.com        41.5
6  Archana   99.0  Female   archana@yahoo.com        49.5

In [98]:
# suppose we want to convert male to 1 and female to 0 

df1['Male_Female']=df1['Gender'].map({'Male':1,'Female':0})

In [99]:
df1

      Name  Marks  Gender               Email  Half_marks  Male_Female
0  Priyang   98.0    Male   priyang@gmail.com        49.0            1
1   Aadhya   93.2  Female    aadhya@gmail.com        46.6            0
2   Krisha   99.0  Female    krisha@gmail.com        49.5            0
3   Vedant   87.0    Male    vedant@yahoo.com        43.5            1
4   Parshv   93.2    Male  parshv@hotmail.com        46.6            1
5   Mittal   83.0  Female    mittal@yahoo.com        41.5            0
6  Archana   99.0  Female   archana@yahoo.com        49.5            0

In [102]:
# Dropping a column

df1.drop('Male_Female', axis=1,inplace=True)

In [104]:
df1

      Name  Marks  Gender               Email  Half_marks
0  Priyang   98.0    Male   priyang@gmail.com        49.0
1   Aadhya   93.2  Female    aadhya@gmail.com        46.6
2   Krisha   99.0  Female    krisha@gmail.com        49.5
3   Vedant   87.0    Male    vedant@yahoo.com        43.5
4   Parshv   93.2    Male  parshv@hotmail.com        46.6
5   Mittal   83.0  Female    mittal@yahoo.com        41.5
6  Archana   99.0  Female   archana@yahoo.com        49.5

# 19. Sort dataframe as per marks column

In [105]:
df1.sort_values(by='Marks',ascending=False)

      Name  Marks  Gender               Email  Half_marks
2   Krisha   99.0  Female    krisha@gmail.com        49.5
6  Archana   99.0  Female   archana@yahoo.com        49.5
0  Priyang   98.0    Male   priyang@gmail.com        49.0
1   Aadhya   93.2  Female    aadhya@gmail.com        46.6
4   Parshv   93.2    Male  parshv@hotmail.com        46.6
3   Vedant   87.0    Male    vedant@yahoo.com        43.5
5   Mittal   83.0  Female    mittal@yahoo.com        41.5

# 20. Display Name and Marks of female student only

In [110]:
df1[df1['Gender']=='Female'][['Name','Marks']]

      Name  Marks
1   Aadhya   93.2
2   Krisha   99.0
5   Mittal   83.0
6  Archana   99.0

In [113]:
# second method 

df1[df1['Gender'].isin(['Female'])][['Name','Marks']]

      Name  Marks
1   Aadhya   93.2
2   Krisha   99.0
5   Mittal   83.0
6  Archana   99.0

# 21. Rename the marks column

In [114]:
df1.rename(columns={'Marks':"Final_Marks"})

      Name  Final_Marks  Gender               Email  Half_marks
0  Priyang         98.0    Male   priyang@gmail.com        49.0
1   Aadhya         93.2  Female    aadhya@gmail.com        46.6
2   Krisha         99.0  Female    krisha@gmail.com        49.5
3   Vedant         87.0    Male    vedant@yahoo.com        43.5
4   Parshv         93.2    Male  parshv@hotmail.com        46.6
5   Mittal         83.0  Female    mittal@yahoo.com        41.5
6  Archana         99.0  Female   archana@yahoo.com        49.5

# 22. Concate two dataset

In [115]:
df1

      Name  Marks  Gender               Email  Half_marks
0  Priyang   98.0    Male   priyang@gmail.com        49.0
1   Aadhya   93.2  Female    aadhya@gmail.com        46.6
2   Krisha   99.0  Female    krisha@gmail.com        49.5
3   Vedant   87.0    Male    vedant@yahoo.com        43.5
4   Parshv   93.2    Male  parshv@hotmail.com        46.6
5   Mittal   83.0  Female    mittal@yahoo.com        41.5
6  Archana   99.0  Female   archana@yahoo.com        49.5

In [118]:
# lets create another dataframe so that we can concat them

df2= pd.DataFrame({"Name":"Anil",
                   "Marks": 90,
                   "Gender":"Male",
                   "Email": "anil@gmail.com"},index=[0])

In [120]:
df2

   Name  Marks Gender           Email
0  Anil     90   Male  anil@gmail.com

In [121]:
# now lets concate or join both dataframe

df3= pd.concat([df1,df2])

In [122]:
df3 # here we can see the index number after the last value of first dataset is zero because thats new dataset value starting

      Name  Marks  Gender               Email  Half_marks
0  Priyang   98.0    Male   priyang@gmail.com        49.0
1   Aadhya   93.2  Female    aadhya@gmail.com        46.6
2   Krisha   99.0  Female    krisha@gmail.com        49.5
3   Vedant   87.0    Male    vedant@yahoo.com        43.5
4   Parshv   93.2    Male  parshv@hotmail.com        46.6
5   Mittal   83.0  Female    mittal@yahoo.com        41.5
6  Archana   99.0  Female   archana@yahoo.com        49.5
0     Anil   90.0    Male      anil@gmail.com         NaN

In [126]:
# to solve above issue we need to ignore index


df3=pd.concat([df1,df2],ignore_index= True)

In [127]:
df3

      Name  Marks  Gender               Email  Half_marks
0  Priyang   98.0    Male   priyang@gmail.com        49.0
1   Aadhya   93.2  Female    aadhya@gmail.com        46.6
2   Krisha   99.0  Female    krisha@gmail.com        49.5
3   Vedant   87.0    Male    vedant@yahoo.com        43.5
4   Parshv   93.2    Male  parshv@hotmail.com        46.6
5   Mittal   83.0  Female    mittal@yahoo.com        41.5
6  Archana   99.0  Female   archana@yahoo.com        49.5
7     Anil   90.0    Male      anil@gmail.com         NaN

# 23. loc and iloc funcitons

In [128]:
df3

      Name  Marks  Gender               Email  Half_marks
0  Priyang   98.0    Male   priyang@gmail.com        49.0
1   Aadhya   93.2  Female    aadhya@gmail.com        46.6
2   Krisha   99.0  Female    krisha@gmail.com        49.5
3   Vedant   87.0    Male    vedant@yahoo.com        43.5
4   Parshv   93.2    Male  parshv@hotmail.com        46.6
5   Mittal   83.0  Female    mittal@yahoo.com        41.5
6  Archana   99.0  Female   archana@yahoo.com        49.5
7     Anil   90.0    Male      anil@gmail.com         NaN

In [129]:
# in loc function we can use columns name to access them which we cannot do in iloc
df1.loc[:,'Marks':'Gender']

   Marks  Gender
0   98.0    Male
1   93.2  Female
2   99.0  Female
3   87.0    Male
4   93.2    Male
5   83.0  Female
6   99.0  Female

In [130]:
df1.iloc[1,2] # to get value from 1st row and 2nd column

'Female'

In [133]:
df1.iloc[:,2]

0      Male
1    Female
2    Female
3      Male
4      Male
5    Female
6    Female
Name: Gender, dtype: object

# 24. Create new feature from Name and Marks

In [138]:
# so to add name and marks column we need to have same datatype of both column
# for we change datatype of  marks to string 

df1['Name_Marks']=df1['Name']+' ' +df1['Marks'].apply(str)

In [139]:
df1

      Name  Marks  Gender               Email  Half_marks    Name_Marks
0  Priyang   98.0    Male   priyang@gmail.com        49.0  Priyang 98.0
1   Aadhya   93.2  Female    aadhya@gmail.com        46.6   Aadhya 93.2
2   Krisha   99.0  Female    krisha@gmail.com        49.5   Krisha 99.0
3   Vedant   87.0    Male    vedant@yahoo.com        43.5   Vedant 87.0
4   Parshv   93.2    Male  parshv@hotmail.com        46.6   Parshv 93.2
5   Mittal   83.0  Female    mittal@yahoo.com        41.5   Mittal 83.0
6  Archana   99.0  Female   archana@yahoo.com        49.5  Archana 99.0

# 25. Find the highest avg value per gender

In [143]:
type(df1.groupby('Gender')['Marks'].mean()) # right now its a series

pandas.core.series.Series

In [145]:
# to convert the above series to dataframe

df1.groupby('Gender')['Marks'].mean().sort_values().to_frame()

            Marks
Gender
Male    92.733333
Female  93.550000

In [146]:
# now if we check the type it will show as dataframe

type(df1.groupby('Gender')['Marks'].mean().sort_values().to_frame())

pandas.core.frame.DataFrame

# 26. What are the top 5 popular email providers

In [147]:
df1

      Name  Marks  Gender               Email  Half_marks    Name_Marks
0  Priyang   98.0    Male   priyang@gmail.com        49.0  Priyang 98.0
1   Aadhya   93.2  Female    aadhya@gmail.com        46.6   Aadhya 93.2
2   Krisha   99.0  Female    krisha@gmail.com        49.5   Krisha 99.0
3   Vedant   87.0    Male    vedant@yahoo.com        43.5   Vedant 87.0
4   Parshv   93.2    Male  parshv@hotmail.com        46.6   Parshv 93.2
5   Mittal   83.0  Female    mittal@yahoo.com        41.5   Mittal 83.0
6  Archana   99.0  Female   archana@yahoo.com        49.5  Archana 99.0

In [150]:
list1=[]

for email in df1['Email']:
    list1.append(email.split('@')[1])

In [151]:
list1

['gmail.com',
 'gmail.com',
 'gmail.com',
 'yahoo.com',
 'hotmail.com',
 'yahoo.com',
 'yahoo.com']

In [152]:
# now we will create new column with this 

df1['temp']=list1

In [153]:
df1

,Name,Marks,Gender,Email,Half_marks,Name_Marks,temp
0,Priyang,98.0,Male,priyang@gmail.com,49.0,Priyang 98.0,gmail.com
1,Aadhya,93.2,Female,aadhya@gmail.com,46.6,Aadhya 93.2,gmail.com
2,Krisha,99.0,Female,krisha@gmail.com,49.5,Krisha 99.0,gmail.com
3,Vedant,87.0,Male,vedant@yahoo.com,43.5,Vedant 87.0,yahoo.com
4,Parshv,93.2,Male,parshv@hotmail.com,46.6,Parshv 93.2,hotmail.com
5,Mittal,83.0,Female,mittal@yahoo.com,41.5,Mittal 83.0,yahoo.com
6,Archana,99.0,Female,archana@yahoo.com,49.5,Archana 99.0,yahoo.com

In [154]:
df1['temp'].value_counts()

gmail.com      3
yahoo.com      3
hotmail.com    1
Name: temp, dtype: int64

In [157]:
# using lambda funciton

df1['Email'].apply(lambda x:x.split('@')[1]).value_counts().head()

gmail.com      3
yahoo.com      3
hotmail.com    1
Name: Email, dtype: int64